================================================================================
Empty comment
================================================================================
//
/**/
module foo
--------------------------------------------------------------------------------

(source_file
  (comment)
  (comment)
  (module_clause
    (identifier)))

================================================================================
Line comment
================================================================================
// Line comment
// Line comment
module foo
--------------------------------------------------------------------------------

(source_file
  (comment)
  (comment)
  (module_clause
    (identifier)))

================================================================================
Multiline comment
================================================================================
/*
  Multiline comment
  Multiline comment
*/
module foo
--------------------------------------------------------------------------------

(source_file
  (comment)
  (module_clause
    (identifier)))

================================================================================
Multiline nested comment
================================================================================
/*
  /* Nested */
  Multiline comment
  /* Nested */
  Multiline comment
  /* Nested */
*/
// comment /* comment */
module foo
/*
  Multiline comment
  /*
    Multiline comment
    /*
      Multiline comment
      /* Nested */
      Multiline comment
    */
    Multiline comment
  */
  Multiline comment
*/
--------------------------------------------------------------------------------

(source_file
  (comment)
  (comment)
  (module_clause
    (identifier))
  (comment))

================================================================================
Shebang
================================================================================
#!/usr/bin/env -S v

foo := 'foo'
--------------------------------------------------------------------------------

(source_file
  (comment)
  (simple_statement
    (var_declaration
      (expression_list
        (reference_expression
          (identifier)))
      (expression_list
        (literal
          (interpreted_string_literal))))))
